# 题库
demiuk=[]

demiuk.append({
    'dekanh': '先拂交通运输部2020年5月先拂交通知识测试\n热身题\n(先拂历史)下列车站中历史最长的是？\nA.1号线起点草原\nB.2号线近畿\nC.3号线辽阳\nD.4号线皇安',
    'topqanh':'A',
    'krexsek':'从最老到最新排序：ABDC。'
})

demiuk.append({
    'dekanh':'(先拂地理)下列说法错误的是？\nA.最西和最东的车站在同一条线路上\nB.最南和最北的车站在同一条线路上\nC.离(0,70,0)最近的车站是起点草原\nD.离出生点最近的车站是起点草原',
    'topqanh':'B',
    'krexsek':'A：最西的车站是2号线永理站，最东的车站是2号线雍环站。\nB：最南的车站是6号线罗湖站，最北的车站是1号线瑷珲站。\nCD：正确。'
})

demiuk.append({
    'dekanh':'(先拂地理)下列说法错误的是？\nA.离GUC贵都医院最近的车站是贵都\nB.离亚羽商场最近的车站是亚羽\nC.离确塔小区最近的车站是确塔\nD.离大剧院最近的车站是大剧院',
    'topqanh':'A',
    'krexsek':'A：应为邯郸。\nBCD：正确。'
})

demiuk.append({
    'dekanh':'(先拂地理)下列说法错误的是？\nA.出口最多的车站是邯郸\nB.邯郸站B口外是贵都银行\nC.邯郸站D口外是GUC贵都医院\nD.邯郸站E口外是GUC贵都医院',
    'topqanh':'B',
    'krexsek':'B：应为A口。\nACD：正确。'
})

demiuk.append({
    'dekanh':'(先拂地理)下列哪条道路没有并行的矿铁？\nA.银山大街\nB.亚羽西街\nC.亚羽东街\nD.程军路',
    'topqanh':'D',
    'krexsek':'A：高架8号线。\nB：地下6号线。\nC：地下20号线支线。\nD：无矿铁并行。'
})

demiuk.append({
    'dekanh':'(先拂地理)下列哪两条道路首尾相接？\nA.滨海北路、亚羽东街\nB.亚羽东街、亚羽西街\nC.亚羽西街、影瑟路\nD.影瑟路、银山大街',
    'topqanh':'A',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂地理)在某个换乘站，不可能在路牌上看到下列哪一项？\nA.下一站 雨花台\nB.下一站 大学城北\nC.下一站 土画(⇆5)\nD.下一站 大忠',
    'topqanh':'B',
    'krexsek':'A：在9号线康今、鹤凫洲。\nB：18号线斗兽场和农业学院均不是换乘站。\nC：在18号线石仙港。\nD：在1号线起点草原，20号线近畿、确塔，20号线支线邯郸。'
})

demiuk.append({
    'dekanh':'(先拂地理)GUC大学城中，下列地点离矿铁大学城北站最近的是？\nA.南极科考站\nB.红石研究基地\nC.通天塔\nD.丛林树屋',
    'topqanh':'C',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂地理)GUC大学城中，下列地点离矿铁大学城西站最近的是？\nA.史蒂夫斗兽场\nB.南方小屋\nC.主基地\nD.农业学院',
    'topqanh':'A',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂地理)下列哪座车站不位于沙漠？\nA.小撒哈拉\nB.托克逊\nC.岩朋\nD.毛马',
    'topqanh':'C',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂地理)下列哪座车站位于雨林？\nA.明铁\nB.丰岭道\nC.南开\nD.延安',
    'topqanh':'A',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂地理)王家店大桥是哪两站间的跨海大桥？\nA.起点草原-日喀则\nB.日喀则-拉萨\nC.拉萨-延安\nD.延安-起点草原',
    'topqanh':'D',
    'krexsek':'A：西宁大桥。\nB：未命名。\nC：衢水大桥。\nD：王家店大桥。'
})

demiuk.append({
    'dekanh':'(先拂地理)以下哪一项不是后加的车站？\nA.2号线张家口\nB.8号线大学城西\nC.9号线鹤凫洲\nD.18号线莱茗',
    'topqanh':'D',
    'krexsek':'其实，本题并非考察车站是否后加，而是考察车站是否存在，所以是地理题。\nABC：均为该线中间最初没有、后来新增的站。\nD：该站在20号线支线上，18号线没有这一站。'
})

demiuk.append({
    'dekanh':'(先拂地理)从离灯塔餐厅最近的车站上车，下列哪一项一定需要换乘才能到达？\nA.GUC大学城南极科考站处的车站\nB.离中央人民政府最近的车站\nC.最北的车站\nD.一座三线换乘站',
    'topqanh':'C',
    'krexsek':'离灯塔餐厅最近的车站是邯郸，有8号线和20号线支线经过。\nA：指浮冰原，有8号线。\nB：指近畿，有20号线。\nC：指瑷珲，需换乘1号线到达。\nD：可能指8号线的崇明、贵都，或20号线及支线的石仙港、近畿。'
})

demiuk.append({
    'dekanh':'(先拂地理)从起点草原站到怀圆响湖站至少需要换乘一次。在哪里换乘总用时最短？\nA.神木\nB.大忠\nC.贵都\nD.康今',
    'topqanh':'C',
    'krexsek':'总用时最短的方案：乘坐1号线到贵都，换乘光速船K18线直达怀圆站，再通过站内通道到达怀圆响湖站。其他方案用时较长。\nA：1换18。\nB：1换20支，20支换18。\nC：1换K18，正确。\nD：2换9，9换18。'
})

demiuk.append({
    'dekanh':'(先拂地理)嗅探在某车站上矿车，想去高松。他一直没有下车，依次遇到以下情形：\n1.在站台上看到南瓜灯\n2.听到报站：……可换乘3号线和18号线\n3.路牌上写有：南⇧ 换乘车站 典灵山站\n4.太阳从他背后升起时，他看到前方蓝色混凝土主题的铁路\n以下说法一定错误的是：\nA.他坐过站了\nB.他坐的路线绕远了\nC.他继续坐到不了高松\nD.他应该立即下车',
    'topqanh':'C',
    'krexsek':'1：他在银山大街站。\n2：可以确定他在8号线上，下一站是崇明。\n3：他在典灵山站，结合1、2知他在8号线内环。\n4：太阳从南方升起，故他现在正向北行；蓝色混凝土是矿铁2号线的代表材料，故他面前是2号线。已知他在8号线内环，故他将要到达执鲁。\n从银山大街到高松的最短路径是8号线外环直达。\nB：嗅探坐了内环，绕远了。\nA.由4知他坐过站了。\nD.执鲁到高松最短路径是8号线外环，故他应该立即下车往回坐。\nC.8号线是环线，一直不下车总能再次到达高松。'
})

demiuk.append({
    'dekanh':'(先拂历史)下列线路中哪条不曾存在过？\nA.西泠河支线\nB.亚马孙河支线\nC.小撒哈拉支线\nD.塔城支线',
    'topqanh':'C',
    'krexsek':'A：存在，白池-西泠河，9号线南延后停运。\nB：存在，高松-亚马孙河，后划归8号线。\nC：不存在，小撒哈拉是主线车站，不会用来命名支线。小撒哈拉-大撒哈拉-河左称为大撒哈拉支线，9号线南延后停运。\nD：存在，芃闸-塔城-圆青浦，今仍在运营。'
})

demiuk.append({
    'dekanh':'(先拂历史)下列车站中历史最短的是？\nA.1号线桃源\nB.2号线澳门\nC.3号线顺湘\nD.4号线丹江',
    'topqanh':'B',
    'krexsek':'从最老到最新排序：ADCB。2号线澳门是后加站。'
})

demiuk.append({
    'dekanh':'(先拂历史)下列车站中历史最长的是？\nA.5号线土画\nB.6号线琉璃\nC.7号线大剧院\nD.9号线康今',
    'topqanh':'C',
    'krexsek':'从最老到最新排序：CBDA。'
})

demiuk.append({
    'dekanh':'(先拂历史)最初建设8号线时，哪个站建设最晚？\nA.贵都\nB.北海\nC.滁州\nD.执鲁',
    'topqanh':'D',
    'krexsek':'从建设顺序排序：ABCD。执鲁是最初建设8号线的最后一站，8号线在此连成环线，臤徘斯(Kinboise)放羊毛烟花庆祝。'
})

demiuk.append({
    'dekanh':'(先拂历史)下列哪种交通方式不曾存在过？\nA.轻轨\nB.无轨\nC.光速船\nD.蓝冰船',
    'topqanh':'A',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂历史)下列哪座车站没有重建过？\nA.亚羽\nB.近畿\nC.滨海\nD.贵都',
    'topqanh':'C',
    'krexsek':'滨海是2号线的后加站。'
})

demiuk.append({
    'dekanh':'(先拂历史)下列哪座车站被迁移过？\nA.亚羽\nB.近畿\nC.滨海\nD.贵都',
    'topqanh':'A',
    'krexsek':'亚羽站原址在今亚羽站和邯郸站之间。'
})

demiuk.append({
    'dekanh':'(先拂历史)对于从古至今存在过的所有车站，下列说法错误的是？\nA.离(0,70,0)最近的车站是张岛\nB.离出生点最近的车站是海西\nC.离圆园最近的车站是圆园\nD.离海西图书馆最近的车站是海西',
    'topqanh':'D',
    'krexsek':'D:应为今20号线支线莱茗站。'
})

demiuk.append({
    'dekanh':'(先拂历史)下列哪座车站不是曾经运营后被取消的？\nA.张岛\nB.柏澜路\nC.上阳\nD.霖鞠',
    'topqanh':'C',
    'krexsek':'AB:在1号线北延线，1号线改造时取消。\nC：在21号线，还在规划中，并未建设。\nD：1号线北延线和2号线的换乘站，折改斜时取消。'
})

demiuk.append({
    'dekanh':'(先拂历史)以下哪一项不是后加的车站？\nA.2号线滨海\nB.7号线大剧院\nC.9号线鹤凫洲\nD.2号线澳门',
    'topqanh':'B',
    'krexsek':'ACD都是后加站，在前面的题目均有提及。'
})

demiuk.append({
    'dekanh':'(先拂历史)先拂首座立交桥是哪一座？\nA.亚羽桥\nB.轻沙桥\nC.贵都桥\nD.普洱桥',
    'topqanh':'D',
    'krexsek':'C不存在。从老到新排序：DAB。'
})

demiuk.append({
    'dekanh':'(先拂历史)下列哪个可选方向的铁路岔口历史最长？\nA.西宁大桥\nB.武汉桥\nC.新官路口\nD.旧官路口',
    'topqanh':'B',
    'krexsek':'A不是铁路岔口。\n从老到新排序：BCD。'
})

demiuk.append({
    'dekanh':'(先拂历史)先拂首条公路是哪一条？\nA.近畿北大街\nB.神木南路\nC.贵都西大街\nD.程军路',
    'topqanh':'C',
    'krexsek':'从老到新排序：CDAB。'
})

demiuk.append({
    'dekanh':'(先拂历史)先拂矿铁历史上，站名是用来纪念阿窣（aswert）的车站在哪条线上？\nA.1号线\nB.2号线\nC.1号线北延线\nD.5号线支线',
    'topqanh':'C',
    'krexsek':'指张岛。'
})

demiuk.append({
    'dekanh':'(先拂细节)红色陶瓦是哪条矿铁线的代表材料？\nA.1号线\nB.4号线\nC.7号线\nD.12号线',
    'topqanh':'D',
    'krexsek':'A：红色混凝土。\nB：黄色陶瓦。\nC：橙色陶瓦。\nD：红色陶瓦。'
})

demiuk.append({
    'dekanh':'(先拂细节)蓝色陶瓦是哪条矿铁线的代表材料？\nA.2号线\nB.3号线\nC.5号线\nD.15号线',
    'topqanh':'D',
    'krexsek':'A：蓝色混凝土。\nB：淡蓝色混凝土。\nC：蓝色陶瓦。\nD：淡蓝色陶瓦。'
})

demiuk.append({
    'dekanh':'(先拂细节)下列哪座车站是全地下车站（地上最多有出入口）？\nA.起点草原\nB.空中花园\nC.北高地宫\nD.贵都',
    'topqanh':'B',
    'krexsek':'A：2号线站台及1号线延安方向站台在地上。\nB：正确，在14号线上。\nC：完全是高架车站。\nD：1号线站台在地上。'
})

demiuk.append({
    'dekanh':'(先拂细节)下列哪条道路地下没有矿铁？\nA.贵都西大街\nB.亚羽西街\nC.石仙大街\nD.银山大街',
    'topqanh':'D',
    'krexsek':'在前面的题目有提及。\nA：地下有8号线。\nB：地下有6号线。\nC：地下有20号线支线。\nD：与之并行的8号线为高架，地下无矿铁。'
})

demiuk.append({
    'dekanh':'(先拂细节)银山大街站没有使用下列哪种材料？\nA.末地石砖\nB.地狱石砖\nC.南瓜灯\nD.混凝土',
    'topqanh':'B',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂细节)下列哪座车站主体用金合欢木板建造？\nA.先纬\nB.康今\nC.贵都\nD.神木',
    'topqanh':'D',
    'krexsek':'A：蓝色混凝土。\nB：青金石。\nC：橡木板。\nD：金合欢木板。'
})

demiuk.append({
    'dekanh':'(先拂细节)下列哪条道路没有自行猪道？\nA.银山大街\nB.亚羽西街\nC.亚羽东街\nD.程军路',
    'topqanh':'A',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂细节)下列说法错误的是？\nA.银山大街是同台换乘站（下车后对面就是另一条线路）\nB.大忠是互通换乘站（不用下车就能换乘）\nC.8号线邯郸站使用岛式站台（铁路在两侧，站台在中间）\nD.3号线汝水使用侧式站台（铁路在中间，站台在两边）',
    'topqanh':'C',
    'krexsek':' '
})

demiuk.append({
    'dekanh':'(先拂细节)下列关于乘坐矿铁的说法正确的是？\nA.从大忠坐到日喀则，中途无需下车\nB.从日喀则坐到大忠，中途无需下车\nC.从康今坐到塔城，需要在芃闸下车一次\nD.从长椿坐到塔城，需要在圆青浦下车一次',
    'topqanh':'B',
    'krexsek':'A：需要在起点草原下车一次。BCD：无需下车。'
})

demiuk.append({
    'dekanh':'(先拂细节)下列关于邯郸路口的红绿灯的说法正确的是？\nA.80秒一循环\nB.0秒时，南北向绿灯亮\nC.24秒时，东西向红灯亮\nD.东西向左转绿灯时长为8秒',
    'topqanh':'D',
    'krexsek':'60秒一循环。\n0秒：东西直行绿灯。\n24秒：东西直行黄灯。\n26秒：东西直行红灯。\n28秒：东西左转绿灯。\n36秒：东西左转黄灯。\n38秒：东西左转红灯。\n40秒：南北绿灯。\n56秒：南北黄灯。\n58秒：南北红灯。'
})

cungx=len(demiuk)